{"by":"nickjj","id":22891470,"kids":[22894404,22892895,22891573],"parent":22891254,"text":"I use Stripe and PayPal currently but on the next platform I&#x27;m currently building I&#x27;m strongly (and very seriously) considering Braintree.<p>With PayPal, the fraud experience has been nothing short of amazing. Out of many many thousands of transactions, I&#x27;ve only had about 3 or 4 transactions get flagged as high risk by PayPal. What this means is PayPal will hold the funds, review the transaction and then either give you the funds if it&#x27;s legit or do something else if it&#x27;s not legit.<p>I&#x27;ve had 0 cases on PayPal where fraud &#x2F; disputes actually took place. Of those 3-4 transactions, they were all released. None of this required any intervention by me. I just got notified by email from PayPal when a high risk transaction occurred. 100% of the funds were put back into my account a few days later (short of the normal 2.9% + 30c fees).<p>On Stripe, I&#x27;ve also had many many thousands of transactions. I&#x27;ve had a number of fraud transactions in the process which ended up as disputes. Stripe sends out an email letting you know, but then it&#x27;s now on you to decide if you want to contest the dispute. This dispute typically happens when someone who got their credit card stolen sees an unknown charge in their records.<p>Now you need to fill out like 8 form fields and supply screenshots and server logs of proof that someone was accessing the material they&#x27;ve stolen (I sell digital courses so there&#x27;s no physical item). The screenshots need to be sized perfectly to be displayed in portrait mode on a sheet of paper that gets faxed over to the person reviewing it from the bank, otherwise it&#x27;ll be unreadable from their perspective and you&#x27;ll auto-lose the case.<p>Stripe doesn&#x27;t let you see a real preview of these screenshots and they even alter the uploaded image size in your preview which makes it hard to preview what it will look like from the reviewer&#x27;s POV even though that&#x27;s the only thing that matters.<p>After doing that, it takes about 2-3 months to get a resolution. You get charged a $15 bank dispute fee (on top of the full amount of the product of course) which is non-refundable unless you happen to win the dispute, but if someone got their card stolen then you&#x27;re not going to win the case. You also don&#x27;t get any information from Stripe about the review, other than you won or lost. Stripe says it&#x27;s because banks don&#x27;t give them any info beyond that. Fine, that&#x27;s ok, but yeah the overall experience is very very bad.<p>Then on top of that, Stripe sells a Radar service that you need to pay extra on top of for each transaction to get better tools to help prevent fraud before it takes place. They choose not to give it to everyone because I guess they profit from dispute fees and fraudulent transactions.<p>The kick in the teeth is that the data Stripe uses to train their Radar &#x2F; anti-fraud service is data provided by business owners who have trusted Stripe with their business. Now they are selling that data back to us in the form of insurance fees on each transaction (the Radar service you need to pay for).<p>I haven&#x27;t personally used Braintree yet but from what I read in their docs, you get that type of anti-fraud service baked into the normal 2.9% + 30c (don&#x27;t quote me on that, but it very much reads that way on their site).<p>Whatever PayPal is doing (and in turn Braintree since it&#x27;s a PayPal service), they&#x27;re doing a fantastic job at combating fraud and disputes, especially compared to Stripe.<p><i>&gt; Would you please describe what is sketchy? Their docs seem pretty good... but I am now just hearing about SCA.</i><p>Their docs are typically good, but the SCA &#x2F; Payment Intents docs are not really at the same standards as the rest of their documentation yet.<p>Come back in a few weeks when you&#x27;ve implemented it.<p>What&#x27;s interesting is I run a podcast about running web apps in production and I&#x27;ve had a bunch of folks come on the show who use Stripe to accept payments.<p>All of them have said the experience with implementing SCA with Stripe was pretty rough. These are seasoned developers running successful platforms too.<p>They&#x27;ve all done it in the last couple of months as well.","time":1587057348,"type":"comment"}