{"by":"malandrew","id":22891891,"parent":22890426,"text":"Looks like everyone responding to me completely ignored the fact that my point wasn&#x27;t a defense of large businesses, it was about defending businesses that are more customer-centric. i.e. those businesses that better meets the needs of the customer by providing superior value. Many of the replies actually reinforce my point.<p>That could be restaurants that provide better quality food than the large chain restaurants. It could be a butchers that provide higher quality locally sourced meats than what I can get at Safeway and Walmart. It could be businesses making specialized gear that I use in my outdoor endeavors (Hyperlite Mountain Gear, Mountain Laurel Designs, Astral, Kokatat, Alpacka Raft, etc. etc.). It can be businesses that sell things the big businesses don&#x27;t such as a specialty wine shop. There are tons of good small businesses that provide superior value. Selling the same products as Amazon and Walmart at a higher price with poorer customer service and worse return policy doesn&#x27;t provide superior value.<p>A good business is one that provides superior value. Being large or small tells me nothing about the value being provided.<p>Everyone focusing on things like pricing power is missing the forest for the trees. If you don&#x27;t have pricing power, the money is still leaving the community. Instead of going to the middleman that lives far away, it just goes to the manufacturers that live far away.<p>Furthermore, many of these large companies are public, which means everyone within any community has the opportunity of buying a piece of the company on the open market. The communities that buy the most of such large companies probably even keep more wealth in their community than the ones that don&#x27;t. If enough local people buy shares, then it&#x27;s possible that more profits flow into that particular community than flow out of that community.<p>With a small local retailer, it just means the money flows into the pocket of one person or one family in the community and no one else in the community can buy into that business and get the benefits of the value generated. This is what happens in places like Lake Chelan in Washington, where one family (the Campbells) has a stranglehold on politics and funnels everything to their businesses, which no one else locally is able to buy into.<p>Strong communities with a solid local economy are those that have many such small businesses that provide superior value. If your community does nothing that an Amazon or Walmart does, then there really isn&#x27;t anything that&#x27;s going to flow the balance of payments in your direction and the community will slowly die.","time":1587060114,"type":"comment"}