{"by":"gen220","id":22892061,"kids":[22892541,22893464],"parent":22890523,"text":"In the last few months, I put together a tiny static website for my SO to sell her photographs to clients, and I budgeted a lot of time for integrating a payments solution. Like many others will say, I was pleasantly surprised how <i>little</i> time the integration step took.<p>I used the &quot;beta&quot; react hooks integration, and the UX of getting it all set up was basically flawless. I found the documentation (especially the quickstarts&#x2F;tutorials) to be incredibly helpful.<p>Four pieces of constructive feedback:<p>- There seemed to be 3 or so quickstarts&#x2F;tutorials for the same developer flow, at varying levels of detail (good), but they all had similar names and were difficult to distinguish from each other. My impression was that they were built on top of each other (i.e. one was X years old, another one X-2, etc.), but the old ones weren&#x27;t removed? Unsure.<p>- I found the API documentation to be very good on big screens, but relatively painful on smaller screens.<p>- On my personal laptop (an older thinkpad), scrolling through the docs was unresponsive at times. In general, I&#x27;m a fan of the &quot;everything-on-one-page&quot; approach, because it makes grepping the docs easier. But I think that the quantity of dynamic elements in the API interferes with this approach :&#x2F;<p>- I don&#x27;t appreciate applications that hijack ctrl+f. I appreciate that you can double click to get native browser search, and that this is explained in the modal, but I really wonder if this helps people navigate more efficiently. I appreciate that the work that&#x27;s gone into this feature must be very impressive, but I&#x27;d prefer a search bar with a different hotkey than ctrl+f. Might be worth AB testing.<p>Ending on a note of praise, the dashboard experience is incredible. Huge kudos on how far it&#x27;s come, and how easy it is for nontechnical people to use and discover.","time":1587061435,"type":"comment"}