{"by":"mchusma","id":22892643,"parent":22890523,"text":"Thanks for reaching out. You have a giant feature gap, but also an org problem I think and I would like to explain because I have been trying to get the giant feature gap filled for about 3 years and people there seem to do whatever the opposite of caring is.  It relates to being able to test production environments safely, which in our opinion is something every company should do extensive production testing.<p>Based on many support conversations with me trying to get a feature built here over the last year, Stripe&#x27;s &quot;official position&quot; appears to be &quot;never test your production application.&quot; Sometimes they say &quot;do it but only for $1 every other month&quot;, which is functionally the same as saying &quot;don&#x27;t ever test production.&quot; if you don&#x27;t have any products or services for $1 and do regular deployments.<p>I understand the reasons why you don&#x27;t want people using live credit cards to test in production (e.g. factoring), but that isn&#x27;t what I think most users want to do (it is not what we want to use). We don&#x27;t want to use real cards at all but we want to test production.<p>The best answer to customers who want to test in production is to give them the ability to safety test live cards.  Please see the attached specification I pulled together which would solve this problem for Stripe, card networks, and your customers. If Stripe cannot implement some feature like &quot;Safe Live Testing&quot;, then we will ultimately be forced to migrate away from Stripe. This is a critical feature for us, and I am sure many customers.<p><a href=\"https:&#x2F;&#x2F;tidy-static-websites.s3-us-west-2.amazonaws.com&#x2F;Stripe+Safe+Live+Testing+Spec.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;tidy-static-websites.s3-us-west-2.amazonaws.com&#x2F;Stri...</a><p>We thought our integration with stripe was down in production last week, and we could not run any checks to tell if that was actually the case. This would have fixed it for us.<p>I think there is also a cultural issue here because I believe any mention of &quot;production testing&quot; is currently falling in the compliance camp of Stripe.  Which means their job is to prevent fraud, but nobody seems to say &quot;its ok to want this. The response every time from support and compliance teams is basically &quot;you are bad to test in production, never do it.&quot; But they instead should say &quot;I totally understand why you would want to test your production site.  This is a gap on our side, and we should fix it.&quot; If there is an issue with Visa&#x2F;Mastercard agreements or something, then they should say &quot;I totally understand why you would want to test your production site.  We are completely unable to support it because Visa has this rule that says X, we are working with them to change it. Here is how you can contact Visa to express your support for the rule change, we are spearheading a campaign to ensure customers can do this.&quot;<p>I hope this feedback is helpful, and while the &quot;spec&quot; is not very good, I did put substantial effort into thinking through a solution here, so I hope you review it and get it to the right team. I will also email, thanks!","time":1587065544,"type":"comment"}