{"by":"ttonkytonk","descendants":1,"id":22878611,"kids":[22894561],"score":4,"text":"For no wise human...will allow that any human being errs voluntarily, or voluntarily does evil and dishonorable actions;...<p>And do you, Protagoras, like the rest of the world, call some pleasant things evil and some painful things good? - for I am rather disposed to say that things are good in as far as they are pleasant, if they have no consequences of another sort, and in as far as they are painful they are bad.<p>But are you aware that the majority of the world are of another mind; and that humans are commonly supposed to know the things which are best, and not to do them when they might? And most persons whom I have asked the reason of this have said that when humans act contrary to knowledge they are overcome by pain,or pleasure...<p>Then you think that pain is an evil and pleasure is a good: and even pleasure you deem an evil, when it robs you of greater pleasures than it gives, or causes pains greater than the pleasure...You call pain a good when it takes away greater pains than those which it has,or gives pleasures greater than the pains...<p>...if you are unable to show any good or evil which does not end in pleasure and pain, hear the consequences:...the argument is absurd which affirms that a human often does evil knowingly... And that this is ridiculous will be evident if only we give up the use of various names, such as pleasant and painful, and good and evil. As there are two things, let us call them by two names - first, good and evil, and then pleasant and painful. Assuming this,... a human does evil knowing that they do evil...Because they are overcome...By the good... Is not the real explanation that they are out of proportion to one another, either as greater and smaller,  or more and fewer?<p>Then, I said, no human voluntarily pursues evil... To prefer evil to good is not in human nature; and when a human is compelled to choose one of two evils, no one will choose the greater when they may have the less.","time":1586963439,"title":"Show HN: Plato's Protagoras Highly Abridged","type":"story"}