{"by":"zerzar","descendants":88,"id":22879771,"kids":[22880075,22880177,22880395,22881199,22882582,22880257,22880282,22882892,22881551,22882341,22879944,22885840,22882545,22891011,22881480,22886460,22885784,22881038,22883201,22883055,22881351,22881850],"score":88,"text":"Zerzar &amp; David here from Zynq - we built a calendar extension for Google Calendar to help you easily book meetings with your colleagues, even if they are spread across timezones. You can check it out here: <a href=\"https:&#x2F;&#x2F;zynq.io&#x2F;remote\" rel=\"nofollow\">https:&#x2F;&#x2F;zynq.io&#x2F;remote</a><p>Both of us worked on G Suite and quit last year because we felt enterprise calendars really needed an upgrade and they weren’t a strategic priority for Google&#x2F;Microsoft. As a product manager, I spent a bunch of time organizing meetings and moving them around which was probably the least valuable thing I could have been doing. David, as an engineer, would frequently get interrupted by meetings people would schedule in the middle of his day when he was trying to get work done.<p>We built Zynq to make scheduling intuitive: just tell us who you want to meet &amp; how long you want your meeting to be and we’ll find the best time that works for everyone. Our algorithm looks for open slots during work hours where everyone is free in their timezone &amp; not out for lunch. We rank these slots via a scoring algorithm which prioritizes focus time for everyone invited &amp; picks the top slot.  We then create the meeting and automatically add a Zoom&#x2F;Hangouts link so you never need to set that up manually again.<p>We are launching this for free given the current WFH situation to help teams move faster, but we also have a separate paid product that optimizes for meeting room utilization and that’s how we make money. We don’t plan to charge for this version, but may release paid features on top in the future geared toward larger enterprises. Our goal is to build a complete end-to-end meeting solution for smart offices including meeting room tablet software, guest check-in experience, and an analytics back-end which helps plan future office space.<p>Our long term vision is to automate away the many boring tasks you do at work so you can focus on the creative aspects of your job. We hope this is a step in that direction - please let us know your honest feedback and how we can improve!","time":1586968432,"title":"Launch HN: Zynq (YC W20) – Book meetings instantly with your team","type":"story"}