{"by":"edwinnathaniel","descendants":3,"id":22878024,"kids":[22878472],"score":9,"text":"Hi HN,<p>Lately I&#x27;ve been thinking to move &quot;back&quot; to C to build tools for my own personal use (fun, curiosity, and the urge to go back to basic).<p>At the same time too, lately I noticed that there were resurgent of C discussions&#x2F;materials here and there. Not a lot, but there&#x27;s definitely something brewing, something shaping up in the corner of C world to make the experience less painful and more &quot;standardized&quot; as-per modern software development practice.<p>A background to describe my experience: your typical &quot;cloud&quot; software developer (Java, Go at the backend. Understand design-patterns, enterprise architecture patterns, clean code and the whole shebang. JS at the front-end. K8S + AWS as-needed base. Python for small stuff).<p>What I&#x27;d like to pursue on my free time: FreeBSD (or Linux). C as application-development to start with (think of GTK+, small CLI tools). Eventually, I might want to dig deep and build (or extend&#x2F;expand) infra-related software (think of network software, server software, system-level) but this is not the top priority.<p>If I want to start learning C today to satisfy the top goal: app-dev (GUI, Text-UI, CLI). How should I tackle C? Where should I start from?<p>Imagine I&#x27;m a typical Java-dev who enjoy streamlined experience:<p><pre><code>  - Maven for project management\n  - IntelliJ for IDE\n  - JUnit for automation-test (integrated with IntelliJ)\n  - Swing&#x2F;JavaFX for Desktop-App\n</code></pre>\nAnd also armed with your typical Java &quot;best-practice&quot; books like:<p><pre><code>  - Effective Java\n  - Fowler&#x27;s Enterprise Architecture Patterns\n  - Java-version of Design-Pattern\n  - Uncle Bob Clean Code (just for SOLID principles).\n</code></pre>\nI know that there are several books on &quot;modern C&quot; lately:<p><pre><code>  - Modern C (Manning)\n  - Head First C\n  - Learn C The Hard Way\n  - 21st Century C\n</code></pre>\nIf I can only purchase one C book for the purpose of my single goal: App-Dev. Which one should I go with first that hopefully covers software project management as well as &quot;good practice&quot;.","time":1586960566,"title":"Ask HN: C for Application Development","type":"story"}