{"by":"aloukissas","descendants":14,"id":22892132,"kids":[22894715,22892549,22893688,22892279,22893175,22892695,22892442],"score":31,"text":"Today, we&#x27;re launching https:&#x2F;&#x2F;NeighborPledge.com to support your favorite local businesses, 90% of which can&#x27;t offer takeout&#x2F;gift cards. And 50%+ of small businesses say they will go out of business in the next 2 months (https:&#x2F;&#x2F;twitter.com&#x2F;adam_tooze&#x2F;status&#x2F;1250453327420293122).<p>This site was created to help the places that aren’t getting any help right now. The places that had to close their doors completely.<p>It’s for the dry cleaner that always greets you with a big smile. The little yoga studio that makes you feel calm after a stressful week. The florist that saved you on your anniversary.<p>It’s for your go-to dive bar for happy hour, that hardware store that always has that thingamajig you need and that old childhood arcade you want to take your kid to one day.<p>This site is for businesses in your city. Your neighborhood. Your hometown. Your college town. This is for all of them. Because these local businesses don’t have anyone else to turn to.<p>So pledge a little. Pledge a lot. Pledge something. So they can still be here when we all get through this. Because the only way we are going to get through this is together.<p>Visit NeighborPledge.com and pledge to the businesses you care about. Share it with your friends. And we’ll all make a difference, together.<p>It&#x27;s a work in progress, so please comment here with ideas and suggestions. And we are looking for collaborators to join us in this effort to help.<p>NeighborPledge.com is a labor of love, it&#x27;s not a for-profit entity. We don’t take fees, charge subscription, or ask SMBs for $ in any way. We just want to connect them w&#x2F; local supporters so they&#x27;ll still be here when we all get through this.<p>Who&#x27;s behind NeighborPledge.com? It&#x27;s been mostly Dustin Rosen (https:&#x2F;&#x2F;twitter.com&#x2F;du_ro) and me (https:&#x2F;&#x2F;twitter.com&#x2F;aloukissas), with help from some great people like Abha Nath (https:&#x2F;&#x2F;twitter.com&#x2F;abhanath) and other folks from the LA tech and venture scene.<p>Thanks,\nDustin + Alex","time":1587061913,"title":"50%+ of Small Biz say they will close soon. We built a site to save 90% of them.","type":"story"}